TestingTool_3-0/src/InformationRegisters/СостоянияЗаданий/СостоянияЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗаданий</name>
  <resources>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяНачалаСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВыполненияСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаданий</types>
    </type>
  </resources>
  <resources>
    <name>СтабильностьВыполненияЗаданий</name>
    <type>
      <types>EnumRef.СтабильностьВыполненияЗаданий</types>
    </type>
  </resources>
  <resources>
    <name>ПоследняяПродолжительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнегоУспеха</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнейНеудачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗапускаСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Интервал</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>CatalogRef.Задания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТестируемыйКлиент</name>
    <type>
      <types>CatalogRef.ТестируемыеКлиенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestingTool_3-0/src/InformationRegisters/СостоянияЗаданий/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	// сформируем данные в млс
	Для каждого стр из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(стр.ДатаВыполненияСек) Тогда
			стр.ДатаВыполненияСек = ПланировщикЗаданийКлиентСервер.ПреобразоватьДатуВСек(стр.ДатаВыполнения);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(стр.ВремяНачалаСек) Тогда
			стр.ВремяНачалаСек = ПланировщикЗаданийКлиентСервер.ПреобразоватьДатуВСек(стр.ВремяНачала);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(стр.ИнтервалСек) Тогда
			стр.ИнтервалСек = ПланировщикЗаданийКлиентСервер.ПреобразоватьДатуВСек(стр.Интервал);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	// Вставить содержимое обработчика.
КонецПроцедуры
